Revit 2027 API
BuiltInFailures.OpeningFailures.OpeningDoesnotCutHost Property
 Opening does not cut its host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OpeningDoesnotCutHost { get; }
Public Shared ReadOnly Property OpeningDoesnotCutHost As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OpeningDoesnotCutHost {
	FailureDefinitionId^ get ();
}
static member OpeningDoesnotCutHost : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.OpeningFailures Class
Autodesk.Revit.DB Namespace